4ms/metamodule/firmware-mp2/lib/stm32-hal/stm32mp2/Src/stm32mp2xx_hal_lvds.c
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_lvds.c
  * @author  MCD Application Team
  * @brief   LVDS HAL module driver
  *          This file provides firmware functions to manage the following
  *          functionalities of the Digital Camera Interface (lvds) peripheral:
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral Control functions
  *           + Peripheral State and Error functions
  *
  @verbatim
  ==============================================================================
                        ##### How to use this driver #####
  ==============================================================================


	*** LVDS HAL driver macros list ***
	=============================================
	[..]
	   Below the list of most used macros in LVDS HAL driver.

	  (+) __HAL_LVDS_ENABLE: Enable the LVDS Host.
	  (+) __HAL_LVDS_DISABLE: Disable the LVDS Host.
	  (+) __HAL_LVDS_PLL_ENABLE: Enable the LVDS PLL.
	  (+) __HAL_LVDS_PLL_DISABLE: Disable the LVDS PLL.

  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2017 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_hal.h"

/** @addtogroup STM32MP2xx_HAL_Driver
  * @{
  */
/** @defgroup lvds lvds
 * @brief lvds HAL module driver
 * @{
 */

#ifdef HAL_LVDS_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define LVDS_TIMEOUT_VALUE						((uint32_t)1000U) /* 1s */

/* Private macro -------------------------------------------------------------*/
#define SET_MAP(__MAP__, __FIELD__) (__MAP__) << (__FIELD__)

/* Private variables ---------------------------------------------------------*/

// Expected JEIDA-RGB888 data to be sent in LSB format
//          bit6 ............................bit0
// CHAN0   {ONE, ONE, ZERO, ZERO, ZERO, ONE, ONE}
// CHAN1   {G2,  R7,  R6,   R5,   R4,   R3,  R2}
// CHAN2   {B3,  B2,  G7,   G6,   G5,   G4,  G3}
// CHAN3   {DE,  VS,  HS,   B7,   B6,   B5,  B4}
// CHAN4   {CE,  B1,  B0,   G1,   G0,   R1,  R0}

const HAL_LVDS_MapTypeDef HAL_LVDS_Map_JEIDA_RGB888[5][7] = {
		{HAL_LVDS_MAP_ONE, HAL_LVDS_MAP_ONE, HAL_LVDS_MAP_ZERO, HAL_LVDS_MAP_ZERO, HAL_LVDS_MAP_ZERO, HAL_LVDS_MAP_ONE, HAL_LVDS_MAP_ONE},  // CH0
		{HAL_LVDS_MAP_G_2, HAL_LVDS_MAP_R_7, HAL_LVDS_MAP_R_6,  HAL_LVDS_MAP_R_5,  HAL_LVDS_MAP_R_4,  HAL_LVDS_MAP_R_3, HAL_LVDS_MAP_R_2},
		{HAL_LVDS_MAP_B_3, HAL_LVDS_MAP_B_2, HAL_LVDS_MAP_G_7,  HAL_LVDS_MAP_G_6,  HAL_LVDS_MAP_G_5,  HAL_LVDS_MAP_G_4, HAL_LVDS_MAP_G_3},
		{HAL_LVDS_MAP_D_E, HAL_LVDS_MAP_V_S, HAL_LVDS_MAP_H_S,  HAL_LVDS_MAP_B_7,  HAL_LVDS_MAP_B_6,  HAL_LVDS_MAP_B_5, HAL_LVDS_MAP_B_4},
		{HAL_LVDS_MAP_C_E, HAL_LVDS_MAP_B_1, HAL_LVDS_MAP_B_0,  HAL_LVDS_MAP_G_1,  HAL_LVDS_MAP_G_0,  HAL_LVDS_MAP_R_1, HAL_LVDS_MAP_R_0}	// CH4
};

// Expected VESA-RGB888 data to be sent in LSB format
//          bit6 ............................bit0
// CHAN0   {ONE, ONE, ZERO, ZERO, ZERO, ONE, ONE}
// CHAN1   {G0,  R5,  R4,   R3,   R2,   R1,  R0}
// CHAN2   {B1,  B0,  G5,   G4,   G3,   G2,  G1}
// CHAN3   {DE,  VS,  HS,   B5,   B4,   B3,  B2}
// CHAN4   {CE,  B7,  B6,   G7,   G6,   R7,  R6}

const HAL_LVDS_MapTypeDef HAL_LVDS_Map_VESA_RGB888[5][7] = {
		{HAL_LVDS_MAP_ONE, HAL_LVDS_MAP_ONE, HAL_LVDS_MAP_ZERO, HAL_LVDS_MAP_ZERO, HAL_LVDS_MAP_ZERO, HAL_LVDS_MAP_ONE, HAL_LVDS_MAP_ONE},		// CH0
		{HAL_LVDS_MAP_G_0, HAL_LVDS_MAP_R_5, HAL_LVDS_MAP_R_4,  HAL_LVDS_MAP_R_3,  HAL_LVDS_MAP_R_2,  HAL_LVDS_MAP_R_1, HAL_LVDS_MAP_R_0},		// CH1
		{HAL_LVDS_MAP_B_1, HAL_LVDS_MAP_B_0, HAL_LVDS_MAP_G_5,  HAL_LVDS_MAP_G_4,  HAL_LVDS_MAP_G_3,  HAL_LVDS_MAP_G_2, HAL_LVDS_MAP_G_1},		// CH2
		{HAL_LVDS_MAP_D_E, HAL_LVDS_MAP_V_S, HAL_LVDS_MAP_H_S,  HAL_LVDS_MAP_B_5,  HAL_LVDS_MAP_B_4,  HAL_LVDS_MAP_B_3, HAL_LVDS_MAP_B_2},		// CH3
		{HAL_LVDS_MAP_C_E, HAL_LVDS_MAP_B_7, HAL_LVDS_MAP_B_6,  HAL_LVDS_MAP_G_7,  HAL_LVDS_MAP_G_6,  HAL_LVDS_MAP_R_7, HAL_LVDS_MAP_R_6}		// CH4
};

// Expected JEIDA/VESA-RGB666 data to be sent in LSB format
//          bit6 ............................bit0
// CHAN0   {ONE, ONE, ZERO, ZERO, ZERO, ONE, ONE}
// CHAN1   {G2,  R7,  R6,   R5,   R4,   R3,  R2}
// CHAN2   {B3,  B2,  G7,   G6,   G5,   G4,  G3}
// CHAN3   {DE,  VS,  HS,   B7,   B6,   B5,  B4}
// CHAN4   {00,  00,  00,   00,   00,   00,  00}

const HAL_LVDS_MapTypeDef HAL_LVDS_Map_RGB666[5][7] = {
		{HAL_LVDS_MAP_ONE,  HAL_LVDS_MAP_ONE,  HAL_LVDS_MAP_ZERO,  HAL_LVDS_MAP_ZERO,  HAL_LVDS_MAP_ZERO,  HAL_LVDS_MAP_ONE,  HAL_LVDS_MAP_ONE},	// CH0
		{HAL_LVDS_MAP_G_2,  HAL_LVDS_MAP_R_7,  HAL_LVDS_MAP_R_6,   HAL_LVDS_MAP_R_5,   HAL_LVDS_MAP_R_4,   HAL_LVDS_MAP_R_3,  HAL_LVDS_MAP_R_2},
		{HAL_LVDS_MAP_B_3,  HAL_LVDS_MAP_B_2,  HAL_LVDS_MAP_G_7,   HAL_LVDS_MAP_G_6,   HAL_LVDS_MAP_G_5,   HAL_LVDS_MAP_G_4,  HAL_LVDS_MAP_G_3},
		{HAL_LVDS_MAP_D_E,  HAL_LVDS_MAP_V_S,  HAL_LVDS_MAP_H_S,   HAL_LVDS_MAP_B_7,   HAL_LVDS_MAP_B_6,   HAL_LVDS_MAP_B_5,  HAL_LVDS_MAP_B_4},
		{HAL_LVDS_MAP_ZERO, HAL_LVDS_MAP_ZERO, HAL_LVDS_MAP_ZERO,  HAL_LVDS_MAP_ZERO,  HAL_LVDS_MAP_ZERO,  HAL_LVDS_MAP_ZERO, HAL_LVDS_MAP_ZERO}	// CH4
};

