4ms/metamodule/firmware-mp2/lib/stm32-hal/stm32mp2/Src/stm32mp2xx_hal_lvds.c
/* Private function prototypes -----------------------------------------------*/
void LVDS_PHY_SetPLL(LVDS_HandleTypeDef *hlvds,LVDS_PLLInitTypeDef *PLLInit);

uint32_t LVDS_PHY_StartMst(LVDS_HandleTypeDef *hlvds);
uint32_t LVDS_PHY_StartSlv(LVDS_HandleTypeDef *hlvds);

/* Private functions ---------------------------------------------------------*/
void LVDS_PHY_SetPLL(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit)
{
	uint32_t en_sd, en_twg, fpfd, twg_threshold, twg_step, sd_code;

	/* TODO check other parameters */
//	assert_param(IS_LVDS_PLL_MODE(PLLInit->ISMASTER));
	assert_param(IS_LVDS_PLL_MODE(PLLInit->PLLMODE));
	assert_param(IS_LVDS_PLL_BDIV(PLLInit->PLLBDIV));
	assert_param(IS_LVDS_PLL_MDIV(PLLInit->PLLMDIV));
	assert_param(IS_LVDS_PLL_NDIV(PLLInit->PLLNDIV));
	assert_param(IS_LVDS_PLL_FREF(PLLInit->PLLFREF));

	fpfd = PLLInit->PLLFREF / PLLInit->PLLNDIV;

	if (PLLInit->PLLMODE == LVDS_PLL_MODE_INT) {
		assert_param(PLLInit->FRACIN == 0);
		assert_param(PLLInit->DOWN_SPREAD == 0);

		en_sd = 0;
		en_twg = 0;
		sd_code = 0;
		twg_threshold = 0;
		twg_step = 0;
	} else if (PLLInit->PLLMODE == LVDS_PLL_MODE_FRAC) {
		en_twg = 0;
		if (PLLInit->ISMASTER) {
		 en_sd = LVDS_PMPLLCR1_MST_PLL_SD_ENABLE;
		} else {
			// TODO ?
		}
		twg_threshold = ((4 * PLLInit->MODDEP * PLLInit->PLLMDIV / 100) * 8388608/256) / 1000;
		twg_step = twg_threshold /(fpfd/(4 * PLLInit->MODFREQ));
		sd_code = ((PLLInit->FRACIN * 131072) / 1000) + 4194304;
	} else {
		if (PLLInit->ISMASTER) {
			en_twg = LVDS_PMPLLCR1_MST_PLL_TWG_ENABLE;
			en_sd = LVDS_PMPLLCR1_MST_PLL_SD_ENABLE;
		} else {
			// TODO ?
		}
		twg_threshold = ((4 * PLLInit->MODDEP * PLLInit->PLLMDIV / 100) * 8388608/256) / 1000;
		twg_step = twg_threshold /(fpfd/(4 * PLLInit->MODFREQ));
		sd_code = ((PLLInit->FRACIN * 131072) / 1000) + 4194304;
	}

//	if (PLLInit->ISMASTER) {
		//i_lvds_pll_input_div_setting = input_divider;
		hlvds->Instance->PMPLLCR2 = PLLInit->PLLNDIV << LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_Pos;

		//i_lvds_pll_bit_div_setting = bit_divider;
		hlvds->Instance->PMPLLCR2 |= PLLInit->PLLBDIV << LVDS_PMPLLCR2_MST_PLL_BIT_DIV_Pos;

		//i_lvds_pll_sd_int_ratio = feedback_divider;
		hlvds->Instance->PMPLLSDCR1 = PLLInit->PLLMDIV << LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_Pos;


		//i_lvds_pll_test_div_setting = test_divider;
		hlvds->Instance->PMPLLTESTCR  = PLLInit->TESTDIV << LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_SETTINGS_Pos;

//		//i_lvds_pll_sd_enable = en_sd | en_twg; i_lvds_pll_use_bit_clk_in_sync =1; i_lvds_pll_use_ls_clk_in_sync =1;
//		CLEAR_REG(hlvds->Instance->PMPLLCR1);
//		hlvds->Instance->PMPLLCR1 = en_sd;
//		hlvds->Instance->PMPLLCR1 |= en_twg;
//
//		//i_lvds_pll_twg_threshold = ((4 * modulation_depth * feedback_divider / 100.0) * 8388608/256.0) / 1000.0;
//		hlvds->Instance->PMPLLTWGCR2 = twg_threshold << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos;
//
//		//i_lvds_pll_twg_step  =  i_lvds_pll_twg_threshold /(fpfd/(4 * modulation_frequency));
//		hlvds->Instance->PMPLLTWGCR1 = twg_step << LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Pos;
//
//		//i_lvds_pll_twg_down_spread = down_spread;
//		hlvds->Instance->PMPLLTWGCR1 |= PLLInit->DOWN_SPREAD << LVDS_PMPLLTWGCR1_MST_PLL_TWG_DOWN_SPREAD_Pos;

		//i_lvds_pll_sd_input_code_bypass  = (fractional_component * 131072.0)/1000.0 + 4194304;
//		hlvds->Instance->PMPLLSDCR2 = sd_code << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos;
//  } else {
  	//i_lvds_pll_input_div_setting = input_divider;
  	hlvds->Instance->PSPLLCR2 = PLLInit->PLLNDIV << LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_Pos;

  	//i_lvds_pll_bit_div_setting = bit_divider;
  	hlvds->Instance->PSPLLCR2 |= PLLInit->PLLBDIV << LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_Pos;

  	//i_lvds_pll_sd_int_ratio = feedback_divider;
  	hlvds->Instance->PSPLLSDCR1 = PLLInit->PLLMDIV << LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_Pos;

  	//i_lvds_pll_test_div_setting = test_divider;
  	hlvds->Instance->PSPLLTESTCR  = PLLInit->TESTDIV << LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_Pos;

//  	CLEAR_REG(hlvds->Instance->PSPLLCR1);
//  	//i_lvds_pll_sd_enable = en_sd; i_lvds_pll_use_bit_clk_in_sync =0; i_lvds_pll_use_ls_clk_in_sync =0;
//  	hlvds->Instance->PSPLLCR1 = en_sd << LVDS_PSPLLCR1_SLV_PLL_SD_ENABLE_Pos;
//
//  	//i_lvds_pll_twg_enable = en_twg;
//  	hlvds->Instance->PSPLLCR1 |= en_twg << LVDS_PSPLLCR1_SLV_PLL_TWG_ENABLE_Pos;
//
//  	//i_lvds_pll_twg_threshold = ((4 * modulation_depth * feedback_divider / 100.0) * 8388608/256.0) / 1000.0;
//  	hlvds->Instance->PSPLLTWGCR2 = twg_threshold << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos;
//
//  	//i_lvds_pll_twg_step  =  i_lvds_pll_twg_threshold /(fpfd/(4 * modulation_frequency));
//  	hlvds->Instance->PSPLLTWGCR1 = twg_step << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Pos;
//
//  	//i_lvds_pll_twg_down_spread = down_spread;
//  	hlvds->Instance->PSPLLTWGCR1 |= PLLInit->DOWN_SPREAD << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_DOWN_SPREAD_Pos;
//
//  	//i_lvds_pll_sd_input_code_bypass  = (fractional_component * 131072.0)/1000.0 + 4194304;
//  	hlvds->Instance->PSPLLSDCR2 = sd_code << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos;
//  }
}

uint32_t LVDS_PHY_StartMst(LVDS_HandleTypeDef *hlvds)
{
	uint32_t tickstart;
	volatile uint32_t lock;

	// PLL lock timing control for the monitor unmask after startup (pll_en)
	// Adjust the value so that the masking window is opened at start-up
	hlvds->Instance->PMMPLCR = (0x200-0x160) << LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE_Pos;

	//i_lvds_bias_en = 1 on both PHY
	hlvds->Instance->PMBCR2 = LVDS_PMBCR2_MST_BIAS_EN;

	//i_lvds_ls_clk_out_en = 1;
	//i_lvds_dp_clk_out_en = 1;
	//i_lvds_bit_clk_out_en = 1;
	hlvds->Instance->PMGCR |= LVDS_PMGCR_MST_DP_CLK_OUT_ENABLE | LVDS_PMGCR_MST_LS_CLK_OUT_ENABLE | LVDS_PMGCR_MST_BIT_CLK_OUT_ENABLE;

	//i_lvds_pll_test_div_en = 1;
	hlvds->Instance->PMPLLTESTCR |= LVDS_PMPLLTESTCR_MST_PLL_TEST_DIV_EN ;

	//i_lvds_pll_dividers_en = 1;
	hlvds->Instance->PMPLLCR1 |= LVDS_PMPLLCR1_MST_PLL_DIVIDERS_ENABLE ;

	//i_lvds_ser_data_ok =1;
	hlvds->Instance->PMSCR = LVDS_PMSCR_MST_SER_DATA_OK;

	//i_lvds_pll_en = 1;
	hlvds->Instance->PMPLLCR1 |= LVDS_PMPLLCR1_MST_PLL_ENABLE ;

	/* Get tick */
	tickstart = HAL_GetTick();

    /* Wait for PLL lock (using the new status register)
	 * Wait until the regulator is ready
	 */
	do
	{
		/* Check for the Timeout */
		if ((HAL_GetTick() - tickstart) > LVDS_TIMEOUT_VALUE)
		{
			return HAL_TIMEOUT;
		}
	} while ((hlvds->Instance->PMSSR1 & 0x7) != 0x7);

	HAL_Delay(1000);

