4ms/metamodule/firmware-mp2/lib/stm32-hal/stm32mp2/Src/stm32mp2xx_hal_lvds.c
	// Select MST PHY clock as pixel clock for the LDITX instead of FREF
	hlvds->Instance->WCLKCR = LVDS_WCLKCR_SLV_CLKPIX_SEL;

//    hlvds->Instance->PMPLLTESTCR |= LVDS_PMPLLTESTCR_MST_PLL_TEST_CLK_EN_Msk;

	return lock;
}

// Function to enable PLL/divider/... in SLV PHY
uint32_t LVDS_PHY_StartSlv(LVDS_HandleTypeDef *hlvds)
{
	uint32_t tickstart;
	volatile uint32_t lock;

	// PLL lock timing control for the monitor unmask after startup (pll_en)
	// Adjust the value so that the masking window is opened at start-up
	hlvds->Instance->PSMPLCR = (0x200-0x160) << LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE_Pos;

	//i_lvds_bias_en = 1
	hlvds->Instance->PSBCR2 = LVDS_PSBCR2_SLV_BIAS_EN;

	//i_lvds_ls_clk_out_en = 1;
	//i_lvds_dp_clk_out_en = 1;
	//i_lvds_bit_clk_out_en = 1;
	hlvds->Instance->PSGCR |= LVDS_PSGCR_SLV_DP_CLK_OUT_ENABLE | LVDS_PSGCR_SLV_LS_CLK_OUT_ENABLE | LVDS_PSGCR_SLV_BIT_CLK_OUT_ENABLE;

	//i_lvds_pll_test_div_en = 1;
	hlvds->Instance->PSPLLTESTCR |= LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_EN;

	//i_lvds_pll_dividers_en = 1;
	hlvds->Instance->PSPLLCR1 |= LVDS_PSPLLCR1_SLV_PLL_DIVIDERS_ENABLE;

	//i_lvds_ser_data_ok =1;
	hlvds->Instance->PSSCR = LVDS_PSSCR_SLV_SER_DATA_OK;

	//i_lvds_pll_en = 1;
	hlvds->Instance->PSPLLCR1 |= LVDS_PSPLLCR1_SLV_PLL_ENABLE;

	/* Get tick */
	tickstart = HAL_GetTick();

	// LVDS_PSMPLSR_SLV_MON_PLL_LOCK_PERMANENT_FAULT should go high to indicate lock mechanism is starting
	// Wait for PLL lock
	do
	{
		/* Check for the Timeout */
		if ((HAL_GetTick() - tickstart) > LVDS_TIMEOUT_VALUE)
		{
			return HAL_TIMEOUT;
		}
	} while ((hlvds->Instance->PSSSR1 & 0x7) != 0x7);

	HAL_Delay(1000);

	// Select SLV PHY clock as pixel clock for the LDITX instead of FREF
	hlvds->Instance->WCLKCR = LVDS_WCLKCR_SLV_CLKPIX_SEL;// | LVDS_WCLKCR_SRCSEL;

    hlvds->Instance->PSPLLTESTCR |= LVDS_PSPLLTESTCR_SLV_PLL_TEST_CLK_EN;

	return lock;
}

HAL_StatusTypeDef LVDS_PHY_SetPreEmphasisAmplitude(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit, uint32_t amplitude)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMPEACR = amplitude;
  } else {
  	hlvds->Instance->PSPEACR = amplitude;
  }

	/* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef LVDS_PHY_SetPreEmphasisTime(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit, uint32_t time)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMPETCR = time;
  } else {
  	hlvds->Instance->PSPETCR = time;
  }

	/* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef LVDS_PHY_SetRXLoopback(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit, uint32_t loopback)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMRLPCR = loopback;
  } else {
  	hlvds->Instance->PSRLPCR = loopback;
  }

  /* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef LVDS_PHY_SetCurrentMode(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit, uint32_t reg1, uint32_t reg2)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMCMCR1 = reg1;
    hlvds->Instance->PMCMCR2 = reg2;
  } else {
    hlvds->Instance->PSCMCR1 = reg1;
    hlvds->Instance->PSCMCR2 = reg2;
  }

  /* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef LVDS_PHY_SetFlipedge(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit, uint32_t flipedge)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMFCR = flipedge;
  } else {
    hlvds->Instance->PSFCR = flipedge;
  }

  /* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef LVDS_PHY_SetSpare(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit, uint32_t spare1, uint32_t spare2)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMSCR1 = spare1;
    hlvds->Instance->PMSCR2 = spare2;
  } else {
    hlvds->Instance->PSSCR1 = spare1;
    hlvds->Instance->PSSCR2 = spare2;
  }

  /* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef LVDS_PHY_SetBias(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit,
		uint32_t bias1, uint32_t bias2,
		uint32_t bias3, uint32_t bias4, uint32_t bias5)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMBCR1 = bias1;
    hlvds->Instance->PMBCR2 = bias2;
    hlvds->Instance->PMBCR3 = bias3;
    hlvds->Instance->PMBCR4 = bias4;
    hlvds->Instance->PMBCR5 = bias5;
  } else {
    hlvds->Instance->PSBCR1 = bias1;
    hlvds->Instance->PSBCR2 = bias2;
    hlvds->Instance->PSBCR3 = bias3;
    hlvds->Instance->PSBCR4 = bias4;
    hlvds->Instance->PSBCR5 = bias5;
  }

  /* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef LVDS_PHY_SetImpedance(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit, uint32_t impedance)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMICR = impedance;
  } else {
    hlvds->Instance->PSICR = impedance;
  }

	/* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef LVDS_PHY_SetMonitorBandgapCurrent(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit, uint32_t bandgap)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMMBCCR = bandgap;
  } else {
    hlvds->Instance->PSMBCCR = bandgap;
  }

	/* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef LVDS_PHY_SetMonitorBandgapLoop(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit, uint32_t bandgap_loop)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMMBLCR = bandgap_loop;
  } else {
    hlvds->Instance->PSMBLCR = bandgap_loop;
  }

	/* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef LVDS_PHY_SetMonitorBandgapOutputVoltage(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit, uint32_t voltage)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMMBOVCR = voltage;
  } else {
    hlvds->Instance->PSMBOVCR = voltage;
  }

	/* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

