4ms/metamodule/firmware-mp2/lib/stm32-hal/stm32mp2/Src/stm32mp2xx_hal_lvds.c
HAL_StatusTypeDef LVDS_PHY_SetMonitorPLLLDOOutputVoltage(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit,  uint32_t voltage)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMMPLOVCR = voltage;
  } else {
    hlvds->Instance->PSMPLOVCR = voltage;
  }

	/* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef LVDS_PHY_SetMonitorPLLLock(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit, uint32_t lock)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMMPLCR = lock;
  } else {
    hlvds->Instance->PSMPLCR = lock;
  }

	/* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef LVDS_PHY_SetMonitorPLLReferenceOK(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit, uint32_t ref)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMMPROCR = ref;
  } else {
    hlvds->Instance->PSMPROCR = ref;
  }

	/* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef LVDS_PHY_SetMonitorSerializerClk(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit, uint32_t serializer_clk)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMMSCCR = serializer_clk;
  } else {
    hlvds->Instance->PSMSCCR = serializer_clk;
  }

	/* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef LVDS_PHY_SetMonitorSerializer(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit, uint32_t serializer)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMMSCR = serializer;
  } else {
    hlvds->Instance->PSMSCR = serializer;
  }

	/* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef LVDS_PHY_SetDebug(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit, uint32_t debug)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMDCR = debug;
  } else {
    hlvds->Instance->PSDCR = debug;
  }

	/* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef LVDS_PHY_EnableDataLanes(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit, uint32_t config)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMCFGCR = config;
  } else {
    hlvds->Instance->PSCFGCR = config;
  }

	/* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef LVDS_PHY_SetPLLMode(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit, uint32_t mode1, uint32_t mode2)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMPLLCR1 = mode1;
    hlvds->Instance->PMPLLCR2 = mode2;
  } else {
    hlvds->Instance->PSPLLCR1 = mode1;
    hlvds->Instance->PSPLLCR2 = mode2;
  }

	/* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef LVDS_PHY_SetPLLSD(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit, uint32_t sd1, uint32_t sd2)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMPLLSDCR1 = sd1;
    hlvds->Instance->PMPLLSDCR2 = sd2;
  } else {
    hlvds->Instance->PSPLLSDCR1 = sd1;
    hlvds->Instance->PSPLLSDCR2 = sd2;
  }

	/* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef LVDS_PHY_SetPLLTWG(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit, uint32_t twg1, uint32_t twg2)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMPLLTWGCR1 = twg1;
    hlvds->Instance->PMPLLTWGCR2 = twg2;
  } else {
    hlvds->Instance->PSPLLTWGCR1 = twg1;
    hlvds->Instance->PSPLLTWGCR2 = twg2;
  }

	/* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef LVDS_PHY_SetPLLLDO(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit, uint32_t config)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMPLLLDOCR = config;
  } else {
    hlvds->Instance->PSPLLLDOCR = config;
  }

	/* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef LVDS_PHY_SetPLLCP(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit, uint32_t cp)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMPLLCPCR = cp;
  } else {
    hlvds->Instance->PSPLLCPCR = cp;
  }

	/* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef LVDS_PHY_SetPLLConfig(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit, uint32_t config)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMPLLCFGCR = config;
  } else {
    hlvds->Instance->PSPLLCFGCR = config;
  }

	/* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef LVDS_PHY_SetPLLTest(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit, uint32_t test)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

  if (PLLInit->ISMASTER) {
    hlvds->Instance->PMPLLTESTCR = test;
  } else {
    hlvds->Instance->PSPLLTESTCR = test;
  }

	/* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef core(LVDS_HandleTypeDef *hlvds)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Process locked */
  __HAL_LOCK(hlvds);

	/* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef HAL_LVDS_PHY_PLLConfig(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit)
{
	/* Process locked */
	__HAL_LOCK(hlvds);

