4ms/metamodule/firmware-mp2/lib/stm32-hal/stm32mp2/Src/stm32mp2xx_hal_lvds.c
	/* Check PLLInit parameters */
	assert_param(IS_LVDS_PLL_FREF(PLLInit->PLLFREF));
	assert_param(IS_LVDS_PLL_BDIV(PLLInit->PLLBDIV));
	assert_param(IS_LVDS_PLL_MDIV(PLLInit->PLLMDIV));
	assert_param(IS_LVDS_PLL_NDIV(PLLInit->PLLNDIV));

	/* Power up bias and PLL dividers ******************************************************/
	WRITE_REG(hlvds->Instance->PMDCR, LVDS_PMDCR_MST_POWER_OK);
	WRITE_REG(hlvds->Instance->PSDCR, LVDS_PSDCR_SLV_POWER_OK);

	SET_BIT(hlvds->Instance->PMCMCR1, LVDS_PMCMCR1_MST_CM_EN_DL3	\
									| LVDS_PMCMCR1_MST_CM_EN_DL2	\
									| LVDS_PMCMCR1_MST_CM_EN_DL1	\
									| LVDS_PMCMCR1_MST_CM_EN_DL0);

	SET_BIT(hlvds->Instance->PMCMCR2, LVDS_PMCMCR2_MST_CM_EN_DL4);

//	hlvds->Instance->PMPLLCPCR = 0x00000001;
//	hlvds->Instance->PSPLLCPCR = 0x00000001;

	hlvds->Instance->PMRLPCR = 0x1F000000;
//	hlvds->Instance->PSRLPCR = 0x1F000000;

	SET_BIT(hlvds->Instance->PSCMCR1, LVDS_PSCMCR1_SLV_CM_EN_DL3	\
									| LVDS_PSCMCR1_SLV_CM_EN_DL2	\
									| LVDS_PSCMCR1_SLV_CM_EN_DL1	\
									| LVDS_PSCMCR1_SLV_CM_EN_DL0);

	SET_BIT(hlvds->Instance->PSCMCR2, LVDS_PSCMCR2_SLV_CM_EN_DL4);

	SET_BIT(hlvds->Instance->PMBCR3, LVDS_PMBCR3_MST_VM_EN_DL3	\
									| LVDS_PMBCR3_MST_VM_EN_DL2	\
									| LVDS_PMBCR3_MST_VM_EN_DL1	\
									| LVDS_PMBCR3_MST_VM_EN_DL0	\
									| LVDS_PMBCR3_MST_VM_EN_DL4);

	SET_BIT(hlvds->Instance->PSBCR3, LVDS_PSBCR3_SLV_VM_EN_DL3	\
									| LVDS_PSBCR3_SLV_VM_EN_DL2	\
									| LVDS_PSBCR3_SLV_VM_EN_DL1	\
									| LVDS_PSBCR3_SLV_VM_EN_DL0	\
									| LVDS_PSBCR3_SLV_VM_EN_DL4);

	SET_BIT(hlvds->Instance->PMBCR1, LVDS_PMBCR1_MST_EN_BIAS_DL3	\
									| LVDS_PMBCR1_MST_EN_BIAS_DL2	\
									| LVDS_PMBCR1_MST_EN_BIAS_DL1	\
									| LVDS_PMBCR1_MST_EN_BIAS_DL0	\
									| LVDS_PMBCR1_MST_EN_BIAS_DL4);

	SET_BIT(hlvds->Instance->PSBCR1, LVDS_PSBCR1_SLV_EN_BIAS_DL3	\
									| LVDS_PSBCR1_SLV_EN_BIAS_DL2	\
									| LVDS_PSBCR1_SLV_EN_BIAS_DL1	\
									| LVDS_PSBCR1_SLV_EN_BIAS_DL0	\
									| LVDS_PSBCR1_SLV_EN_BIAS_DL4);

	SET_BIT(hlvds->Instance->PMCFGCR, LVDS_PMCFGCR_MST_EN_DIG_DL);
	SET_BIT(hlvds->Instance->PSCFGCR, LVDS_PSCFGCR_SLV_EN_DIG_DL);

	/* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef HAL_LVDS_ConfigDataMapping(LVDS_HandleTypeDef *hlvds)
{
	/* TODO Set Data Channels for RGB666 color coding */
	if(!(hlvds->Init.ColorCoding)) /* RGB666 */
		HAL_LVDS_SetPattern(hlvds, HAL_LVDS_Map_RGB666);

	if(hlvds->Init.ColorCoding && hlvds->Init.DataMapping) /* VESA-RGB888 */
		HAL_LVDS_SetPattern(hlvds, HAL_LVDS_Map_VESA_RGB888);

	if(hlvds->Init.ColorCoding && !(hlvds->Init.DataMapping)) /* JEIDA-RGB888 */
		HAL_LVDS_SetPattern(hlvds, HAL_LVDS_Map_JEIDA_RGB888);

	return HAL_OK;
}

/* Exported functions --------------------------------------------------------*/

/** @defgroup lvds_Exported_Functions lvds Exported Functions
  * @{
  */

/** @defgroup lvds_Exported_Functions_Group1 Initialization and Configuration functions
 *  @brief   Initialization and Configuration functions
 *
@verbatim
 ===============================================================================
                ##### Initialization and Configuration functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Initialize and configure the lvds
      (+) De-initialize the lvds

@endverbatim
*/

/**
  * @}
  */

/**
  * @brief  Initializes the LVDS according to the specified
  *         parameters in the LVDS_InitTypeDef and create the associated handle.
  * @param  hlvds  pointer to a LVDS_HandleTypeDef structure that contains
  *               the configuration information for the LVDS.
  * @param  PLLInit  pointer to a LVDS_PLLInitTypeDef structure that contains
  *                  the PLL Clock structure definition for the LVDS.
  * @retval HAL status
 */
HAL_StatusTypeDef HAL_LVDS_Init(LVDS_HandleTypeDef *hlvds, LVDS_CfgTypeDef *cfg, LVDS_PLLInitTypeDef *PLLInit)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	/* Initialize the low level hardware */
	if (hlvds->State == HAL_LVDS_STATE_RESET)
		HAL_LVDS_MspInit(hlvds);

	/* Change LVDS peripheral state */
	hlvds->State = HAL_LVDS_STATE_BUSY;

	HAL_LVDS_PHY_Init(hlvds, PLLInit);
	HAL_LVDS_ConfigMode(hlvds, cfg);

	// Fix CDL1CR register
	WRITE_REG(hlvds->Instance->CDL1CR, 0x4321);
//	// Fix CDL2CR register
	WRITE_REG(hlvds->Instance->CDL2CR, 0x59876);

	/****************************** Error management *****************************/

	/* Reset the Error Mask and init the error code */
	hlvds->ErrorMsk = 0U;
	//  TODO Manage LVDS error handling
	//  hlvds->ErrorCode = HAL_LVDS_ERROR_NONE;

	/* Initialize the LVDS state*/
	hlvds->State = HAL_LVDS_STATE_READY;

	return HAL_OK;
}

HAL_StatusTypeDef HAL_LVDS_PHY_Init(LVDS_HandleTypeDef *hlvds, LVDS_PLLInitTypeDef *PLLInit)
{
	HAL_StatusTypeDef status;

	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
		return HAL_ERROR;

	if (PLLInit == NULL)
		return HAL_ERROR;

	/*************************** Enable LVDS PLL ***************************/
	/* Release LVDS PHY Master & Slave from reset */
	WRITE_REG(hlvds->Instance->PMGCR, LVDS_PMGCR_MST_DIVIDERS_RSTN | LVDS_PMGCR_MST_RSTZ);
	WRITE_REG(hlvds->Instance->PSGCR, LVDS_PSGCR_SLV_DIVIDERS_RSTN | LVDS_PSGCR_SLV_RSTZ);

	/*********************** Set the LVDS clock parameters ************************/

	/* Set PLL Slv & Mst configs and timings */
	LVDS_PHY_SetPLL(hlvds, PLLInit);

	status = HAL_LVDS_PHY_PLLConfig(hlvds, PLLInit);
	if (status != HAL_OK)
		return status;

	/*************************** Set the PHY parameters ***************************/

	LVDS_PHY_StartMst(hlvds);
    LVDS_PHY_StartSlv(hlvds);

	return HAL_OK;
}

/**
  * @brief  De-initializes the LVDS peripheral registers to their default reset
  *         values.
  * @param  hlvds  pointer to a LVDS_HandleTypeDef structure that contains
  *               the configuration information for the LVDS.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LVDS_DeInit(LVDS_HandleTypeDef *hlvds)
{
	/* Check the LVDS handle allocation */
	if (hlvds == NULL)
	{
		return HAL_ERROR;
	}

	/* Change LVDS peripheral state */
	hlvds->State = HAL_LVDS_STATE_BUSY;

	/* TODO: Disable things here */
	/* Disable LVDS module */
	__HAL_LVDS_DISABLE(hlvds);

	/* Disable D-PHY clocks and digital */
	CLEAR_BIT(hlvds->Instance->PMGCR, LVDS_PMGCR_MST_RSTZ);
	CLEAR_BIT(hlvds->Instance->PMGCR, (LVDS_PMGCR_MST_DP_CLK_OUT_ENABLE		|
			LVDS_PMGCR_MST_LS_CLK_OUT_ENABLE		|
			LVDS_PMGCR_MST_BIT_CLK_OUT_ENABLE)	);

	/* Shutdown the LVDS PLL */
	__HAL_LVDS_PLL_DISABLE(hlvds);

	/* Assert LVDS PHY Master & Slave in reset mode */
	CLEAR_BIT(hlvds->Instance->PMGCR, LVDS_PMGCR_MST_DIVIDERS_RSTN | LVDS_PMGCR_MST_RSTZ);
	CLEAR_BIT(hlvds->Instance->PSGCR, LVDS_PSGCR_SLV_DIVIDERS_RSTN | LVDS_PSGCR_SLV_RSTZ);

