4ms/metamodule/firmware-mp2/lib/stm32-hal/stm32mp2/Src/stm32mp2xx_hal_lvds.c
	/* DeInit the low level hardware */
	HAL_LVDS_MspDeInit(hlvds);

	/* Reinitialize ErrorCode */
	/* TODO: implement */
	//	hlvds->ErrorCode = HAL_LVDS_ERROR_NONE;

	/* Initialize the LVDS state */
	hlvds->State = HAL_LVDS_STATE_RESET;

	/* Release Lock */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

/**
  * @brief  Initializes the LVDS MSP.
  * @param  hlvds  pointer to a LVDS_HandleTypeDef structure that contains
  *               the configuration information for the LVDS.
  * @retval None
  */
__weak void HAL_LVDS_MspInit(LVDS_HandleTypeDef *hlvds)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlvds);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_LVDS_MspInit could be implemented in the user file
   */
}

/**
  * @brief  De-initializes the LVDS MSP.
  * @param  hlvds  pointer to a LVDS_HandleTypeDef structure that contains
  *               the configuration information for the LVDS.
  * @retval None
  */
__weak void HAL_LVDS_MspDeInit(LVDS_HandleTypeDef *hlvds)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlvds);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_LVDS_MspDeInit could be implemented in the user file
   */
}

HAL_StatusTypeDef HAL_LVDS_ConfigMode(LVDS_HandleTypeDef *hlvds, LVDS_CfgTypeDef *cfg)
{
	uint32_t distribution;
	uint32_t status = HAL_OK;

	/* Check function parameters */
	assert_param(IS_LVDS_LINK(cfg->NumberOfLinks));
	assert_param(IS_LVDS_DISPLAY(cfg->NumberOfDisplays));
	assert_param(IS_LVDS_VS_POLARITY(cfg->VSPolarity));
	assert_param(IS_LVDS_HS_POLARITY(cfg->HSPolarity));
	assert_param(IS_LVDS_DE_POLARITY(cfg->DEPolarity));
	assert_param(IS_LVDS_LINK_PHASE(cfg->LinkPhase));

	/* Set channel distribution */
	CLEAR_BIT(hlvds->Instance->CR, LVDS_CR_LKMOD);

	distribution = (LVDS_CLOCK_LANE_MST << LVDS_CDL1CR_DISTR0_Pos) + (LVDS_DATA_LANE_0 << LVDS_CDL1CR_DISTR1_Pos) \
				+ (LVDS_DATA_LANE_1 << LVDS_CDL1CR_DISTR2_Pos) + (LVDS_DATA_LANE_2 << LVDS_CDL1CR_DISTR3_Pos)
				+ (LVDS_DATA_LANE_3 << LVDS_CDL1CR_DISTR4_Pos);
	HAL_LVDS_SetChannelDistribution(hlvds, LVDS_LINK1_SELECT, distribution);

	if(cfg->NumberOfLinks)
	{
		SET_BIT(hlvds->Instance->CR, LVDS_CR_LKMOD);

		distribution = (LVDS_CLOCK_LANE_SLV << LVDS_CDL2CR_DISTR0_Pos) + (LVDS_DATA_LANE_4 << LVDS_CDL2CR_DISTR1_Pos)
					+ (LVDS_DATA_LANE_5 << LVDS_CDL2CR_DISTR2_Pos) + (LVDS_DATA_LANE_6 << LVDS_CDL2CR_DISTR3_Pos)
					+ (LVDS_DATA_LANE_7 << LVDS_CDL2CR_DISTR4_Pos);

		HAL_LVDS_SetChannelDistribution(hlvds, LVDS_LINK2_SELECT, distribution);
	}

	if(cfg->NumberOfDisplays)
	{
		distribution = (LVDS_CLOCK_LANE_MST << LVDS_CDL2CR_DISTR0_Pos) + (LVDS_DATA_LANE_0 << LVDS_CDL2CR_DISTR1_Pos)
					+ (LVDS_DATA_LANE_1 << LVDS_CDL2CR_DISTR2_Pos) + (LVDS_DATA_LANE_2 << LVDS_CDL2CR_DISTR3_Pos)
					+ (LVDS_DATA_LANE_3 << LVDS_CDL2CR_DISTR4_Pos);

		HAL_LVDS_SetChannelDistribution(hlvds, LVDS_LINK2_SELECT, distribution);
	}

	/* Set Data Mapping */
	status = HAL_LVDS_ConfigDataMapping(hlvds);

	/* Set signal polarity */
	CLEAR_BIT(hlvds->Instance->CR, LVDS_CR_VSPOL | LVDS_CR_HSPOL | LVDS_CR_DEPOL);
	SET_BIT(hlvds->Instance->CR, cfg->VSPolarity | cfg->HSPolarity | cfg->DEPolarity);

	/* Set link phase */
	CLEAR_BIT(hlvds->Instance->CR, LVDS_CR_LKPHA);
	if (cfg->NumberOfLinks)
		SET_BIT(hlvds->Instance->CR, cfg->LinkPhase);

	return status;
}

/**
  * @brief  Start the LVDS module
  * @param  hlvds  pointer to a LVDS_HandleTypeDef structure that contains
  *               the configuration information for the LVDS.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LVDS_Start(LVDS_HandleTypeDef *hlvds)
{
  /* Process locked */
  __HAL_LOCK(hlvds);

  /* Enable the LVDS host */
  __HAL_LVDS_ENABLE(hlvds);

  /* Process unlocked */
  __HAL_UNLOCK(hlvds);

  return HAL_OK;
}

/**
  * @brief  Stop the LVDS module
  * @param  hlvds  pointer to a LVDS_HandleTypeDef structure that contains
  *               the configuration information for the LVDS.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LVDS_Stop(LVDS_HandleTypeDef *hlvds)
{
  /* Process locked */
  __HAL_LOCK(hlvds);

  /* Disable the LVDS host */
  __HAL_LVDS_DISABLE(hlvds);

  /* Process unlocked */
  __HAL_UNLOCK(hlvds);

  return HAL_OK;
}

HAL_StatusTypeDef HAL_LVDS_SetPattern(LVDS_HandleTypeDef *hlvds, const HAL_LVDS_MapTypeDef pattern[5][7])
{
	/* Process locked */
	__HAL_LOCK(hlvds);

	/* TODO check the parameters */
//	assert_param(IS_PATTERN_SIZE(pattern));

	/* Clear the generator */
	CLEAR_REG(hlvds->Instance->DMLCR0);
	CLEAR_REG(hlvds->Instance->DMMCR0);
	CLEAR_REG(hlvds->Instance->DMLCR1);
	CLEAR_REG(hlvds->Instance->DMMCR1);
	CLEAR_REG(hlvds->Instance->DMLCR2);
	CLEAR_REG(hlvds->Instance->DMMCR2);
	CLEAR_REG(hlvds->Instance->DMLCR3);
	CLEAR_REG(hlvds->Instance->DMMCR3);
	CLEAR_REG(hlvds->Instance->DMLCR4);
	CLEAR_REG(hlvds->Instance->DMMCR4);

	/* Set the pattern in Data Mapping */
	WRITE_REG(hlvds->Instance->DMLCR0, ((pattern[0][0]) + (pattern[0][1] << 5) + (pattern[0][2] << 10) + (pattern[0][3] << 15)));
	WRITE_REG(hlvds->Instance->DMMCR0, ((pattern[0][4]) + (pattern[0][5] << 5) + (pattern[0][6] << 10)));
	WRITE_REG(hlvds->Instance->DMLCR1, ((pattern[1][0]) + (pattern[1][1] << 5) + (pattern[1][2] << 10) + (pattern[1][3] << 15)));
	WRITE_REG(hlvds->Instance->DMMCR1, ((pattern[1][4]) + (pattern[1][5] << 5) + (pattern[1][6] << 10)));
	WRITE_REG(hlvds->Instance->DMLCR2, ((pattern[2][0]) + (pattern[2][1] << 5) + (pattern[2][2] << 10) + (pattern[2][3] << 15)));
	WRITE_REG(hlvds->Instance->DMMCR2, ((pattern[2][4]) + (pattern[2][5] << 5) + (pattern[2][6] << 10)));
	WRITE_REG(hlvds->Instance->DMLCR3, ((pattern[3][0]) + (pattern[3][1] << 5) + (pattern[3][2] << 10) + (pattern[3][3] << 15)));
	WRITE_REG(hlvds->Instance->DMMCR3, ((pattern[3][4]) + (pattern[3][5] << 5) + (pattern[3][6] << 10)));
	WRITE_REG(hlvds->Instance->DMLCR4, ((pattern[4][0]) + (pattern[4][1] << 5) + (pattern[4][2] << 10) + (pattern[4][3] << 15)));
	WRITE_REG(hlvds->Instance->DMMCR4, ((pattern[4][4]) + (pattern[4][5] << 5) + (pattern[4][6] << 10)));

