4ms/metamodule/firmware-mp2/lib/stm32-hal/stm32mp2/Src/stm32mp2xx_hal_lvds.c
	/* Process unlocked */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef HAL_LVDS_BistStart(LVDS_HandleTypeDef *hlvds, uint32_t polynome)
{
	/* Process locked */
	__HAL_LOCK(hlvds);

	/* TODO check the parameters */
	assert_param(IS_LVDS_PRBS_POLYNOME(polynome));

	CLEAR_BIT(hlvds->Instance->CDL2CR, LVDS_CDL2CR_PRBS_Msk);
	SET_BIT(hlvds->Instance->CDL2CR, polynome);

	/* Process unlocked */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}


HAL_StatusTypeDef HAL_LVDS_BistStop(LVDS_HandleTypeDef *hlvds)
{
	/* Process locked */
	__HAL_LOCK(hlvds);

	CLEAR_BIT(hlvds->Instance->CDL2CR, LVDS_CDL2CR_PRBS_Msk);

	/* Process unlocked */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

HAL_StatusTypeDef HAL_LVDS_BistConfig(LVDS_HandleTypeDef *hlvds, uint32_t link, uint32_t custom)
{
	return HAL_LVDS_SetChannelDistribution(hlvds, link, custom);
}

HAL_StatusTypeDef HAL_LVDS_SetLanePolarity(LVDS_HandleTypeDef *hlvds, uint32_t link, uint32_t channels)
{
	HAL_StatusTypeDef status = HAL_OK;

	uint32_t lk1pol, lk2pol;
	uint32_t lk2pol_msk = (LVDS_CR_LK2POL_Msk >> LVDS_CR_LK1POL_Pos);
	uint32_t lk1pol_msk = (LVDS_CR_LK1POL_Msk >> LVDS_CR_LK1POL_Pos);

	/* Process locked */
	__HAL_LOCK(hlvds);

	/* TODO: Check function parameters */
	assert_param(IS_LVDS_LINK(link));
	/* uint32_t channels has to be between 0x00U and 0x1FU */
	assert_param(IS_LVDS_CHANNEL(channels));


	/* Computing LK1POL & LK2POL
	 	 channels[9:0] is LVDS_CR.LK2POL + LVDS_CR.LK1POL */
	lk1pol = (channels & lk1pol_msk);
	lk2pol = ((channels & lk2pol_msk) >> 5U);

	/* Set Link polarity */
	CLEAR_BIT(hlvds->Instance->CR, LVDS_CR_LK1POL);
	SET_BIT(hlvds->Instance->CR, (lk1pol << LVDS_CR_LK1POL_Pos));

	CLEAR_BIT(hlvds->Instance->CR, LVDS_CR_LK2POL);
	SET_BIT(hlvds->Instance->CR, (lk2pol << LVDS_CR_LK2POL_Pos));

	/* Process unlocked */
	__HAL_UNLOCK(hlvds);

	return status;
}

/**
 * @brief  Set custom value for a given lane
 * @param  hlvds  		pointer to a LVDS_HandleTypeDef structure that contains
 *               			the configuration information for the LVDS.
 * @param  channel   Lane to be modified.
 * 										This parameter can be LVDS_LINK1_SELECT or LVDS_LINK2_SELECT
 * @param  distribution 		Custom value to modify
 * 										This parameter can be any value of LVDS_Channel_Distribution_values.
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_LVDS_SetChannelDistribution(LVDS_HandleTypeDef *hlvds, uint32_t link, uint32_t distribution)
{
	/* Process locked */
	__HAL_LOCK(hlvds);

	/* Check function parameters */
	assert_param(IS_LVDS_LINK_SELECTED(link));
	assert_param(IS_LVDS_CHANNEL(distribution));

	if (link == LVDS_LINK1_SELECT) {
		CLEAR_REG(hlvds->Instance->CDL1CR);
		WRITE_REG(hlvds->Instance->CDL1CR, distribution);
	} else {
		CLEAR_REG(hlvds->Instance->CDL2CR);
		WRITE_REG(hlvds->Instance->CDL2CR, distribution);
	}

	/* Process unlocked */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

/**
 * @brief  Set custom timing for the PHY
 * @param  hlvds  pointer to a LVDS_HandleTypeDef structure that contains
 *               the configuration information for the LVDS.
 * @param  Timing  PHY timing to be adjusted.
 *                 This parameter can be any value of @arg LVDS_PHY_Timing
 * @param  State  ENABLE or DISABLE
 * @param  Value  Custom value of the timing
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_LVDS_PHY_SetTimings(LVDS_HandleTypeDef *hlvds, uint32_t Timing, FunctionalState State, uint32_t Value)
{
	/* Process locked */
	__HAL_LOCK(hlvds);

	/* TODO: Check function parameters */
	//  assert_param(IS_DSI_PHY_TIMING(Timing));
	//  assert_param(IS_FUNCTIONAL_STATE(State));

	//	TODO: Update

	/* Process unlocked */
	__HAL_UNLOCK(hlvds);

	return HAL_OK;
}

/**
 * @brief	 Return the LVDS state
 * @param	 hlvds	pointer to a LVDS_HandleTypeDef structure that contains
 * 								the configuration information for the LVDS.
 * @retval HAL  state
 */
uint32_t HAL_LVDS_GetState(LVDS_HandleTypeDef *hlvds)
{
	/* Get the state and return it */
	return hlvds->State;
}


#endif /* HAL_LVDS_MODULE_ENABLED */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
